# IFCParameter Template Clear Property Sets Method

Source: https://www.revitapidocs.com/2026/66847d13-a609-806d-f915-6f1f53a2960c.htm

---

| IFCParameter Template Clear Property Sets Method |
| --- |

Removes all property sets from the template.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void ClearPropertySets(
	PropertySetupType propertySetupType
)
```

```
Public Sub ClearPropertySets (
	propertySetupType As PropertySetupType
)
```

```
public:
void ClearPropertySets(
	PropertySetupType propertySetupType
)
```

```
member ClearPropertySets :
        propertySetupType : PropertySetupType -> unit
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace